================================================================================
UPDATE statement
================================================================================

UPDATE table1 SET col1 = 3, col2 = 4

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (identifier)
    (set_clause
      (set_clause_body
        (assigment_expression
          (identifier)
          (number))
        (assigment_expression
          (identifier)
          (number))))))

================================================================================
UPDATE statement with WHERE clause
================================================================================

UPDATE table1 SET col1 = 3, col2 = 4 WHERE col1 > col2

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (identifier)
    (set_clause
      (set_clause_body
        (assigment_expression
          (identifier)
          (number))
        (assigment_expression
          (identifier)
          (number))))
    (where_clause
      (binary_expression
        (identifier)
        (identifier)))))

================================================================================
UPDATE statement with FROM clause
================================================================================

UPDATE foo SET col1 = 1 FROM bar WHERE foo.id = bar.foo_id;

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (identifier)
    (set_clause
      (set_clause_body
        (assigment_expression
          (identifier)
          (number))))
    (from_clause
      (identifier))
    (where_clause
      (binary_expression
        (dotted_name
          (identifier)
          (identifier))
        (dotted_name
          (identifier)
          (identifier))))))

================================================================================
UPDATE with CTE
================================================================================

WITH t AS (
    SELECT * FROM foo
)
UPDATE bar SET col1 = 3, col2 = 4;

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (with_clause
      (cte
        (identifier)
        (select_statement
          (select_clause
            (select_clause_body
              (asterisk_expression)))
          (from_clause
            (identifier)))))
    (identifier)
    (set_clause
      (set_clause_body
        (assigment_expression
          (identifier)
          (number))
        (assigment_expression
          (identifier)
          (number))))))

================================================================================
UPDATE statement with RETURNING clause
================================================================================

UPDATE products SET price = price * 1.10
  WHERE price <= 99.99
  RETURNING name, price AS new_price;

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (identifier)
    (set_clause
      (set_clause_body
        (assigment_expression
          (identifier)
          (binary_expression
            left: (identifier)
            right: (number)))))
    (where_clause
      (binary_expression
        left: (identifier)
        right: (number)))
    (returning_clause
      (identifier)
      (alias
        (identifier)
        (identifier)))))

================================================================================
UPDATE statement with aliased table
================================================================================

UPDATE
	SCHM.TABLE1	TBL1
SET
	TBL1.COLUMN2	=	100
,	TBL1.COLUMN3	=	100
WHERE
	TBL1.COLUMN1	=	10

--------------------------------------------------------------------------------

(source_file
  (update_statement
    (alias
      (dotted_name
        (identifier)
        (identifier))
      (identifier))
    (set_clause
      (set_clause_body
        (assigment_expression
          (dotted_name
            (identifier)
            (identifier))
          (number))
        (assigment_expression
          (dotted_name
            (identifier)
            (identifier))
          (number))))
    (where_clause
      (binary_expression
        left: (dotted_name
          (identifier)
          (identifier))
        right: (number)))))

